In [4]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime
plt.style.use('fivethirtyeight')


%matplotlib inline

pd.options.mode.chained_assignment = None  # default='warn'
df = pd.read_csv('../full-time-employees-by-job-classification.csv')
df.columns = [i.lower().replace(' ', '_') for i in df.columns]

In [5]:
df.head()

,fy,dept_level,job_code,job_title,sum_fte,biweekly_low_rate,biweekly_high_rate
0,2010,AAM,0922,Manager I,2.0,3282.0,4188.0
1,2010,AAM,0963,Dept Head III,1.0,5368.0,6851.0
2,2010,AAM,1450,Executive Secretary 1,1.0,2074.0,2521.0
3,2010,AAM,3302,Admission Attendant,4.0,1349.0,1634.0
4,2010,AAM,3518,"Assoc Musm Cnsrvt, AAM",1.0,2377.0,2890.0

In [8]:
df.describe()

           fy      sum_fte  biweekly_low_rate  biweekly_high_rate
count  2986.0  2986.000000        2986.000000         2986.000000
mean   2010.0    10.566202        2859.964943         3474.723912
std       0.0    63.911325        1214.254594         1446.844802
min    2010.0     0.000000           0.000000            0.000000
25%    2010.0     1.000000        2074.000000         2521.000000
50%    2010.0     2.000000        2700.000000         3263.000000
75%    2010.0     6.000000        3446.000000         4188.000000
max    2010.0  2054.750000       12120.770000        12120.770000

In [10]:
## Highest Paid!!
df[df.biweekly_low_rate == 12120.770000]

,fy,dept_level,job_code,job_title,sum_fte,biweekly_low_rate,biweekly_high_rate
2059,2010,MTA,9186,"Gen Mgr, Public Trnsp Dept",1.0,12120.77,12120.77